Revit 2024 API
DetailCurveArray.ForwardIterator Method
Retrieve a forward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual DetailCurveArrayIterator ForwardIterator()
Visual Basic
Public Overridable Function ForwardIterator As DetailCurveArrayIterator
Visual C++
public:
virtual DetailCurveArrayIterator^ ForwardIterator()
Return Value
Returns a forward moving iterator to the array.
See Also
DetailCurveArray Class
Autodesk.Revit.DB Namespace